* Amerine Menus

This example, from 2018-12, shows some added features of the way that we handle
text searches.  In particular, it shows how you can provided indexable content
to an item at the level of the images within the item.

In order to create this from scratch run the following ~make~ command.

#+BEGIN_SRC bash
make new-collection add-graph ldp ldp.ttl
#+END_SRC



**  Organization

The organization, and Makfile are drawn from the complete amerine-wine menu
collection.  This is found on the library's internal gitlab account.  The files
are organized in the following method.  We've organized each menu via where it
is located in special collections.  That is, we've organized them by
~call_number/box/folder~.  Then within these, we have specified the assigned
ARK as another directory. This works well, as some folders actually have
multiple menues, and this is a good way to disambiguate those.

For each item, we include the

*** Menu subset

We've choosen about 5 menus as examples. This is how to copy them from the
amerine collection.

#+BEGIN_SRC bash :type scalar
amerine=/home/quinn/amerine-menus
menus=/home/quinn/amerine-menus/items

for i in Makefile index.ttl graph.ttl; do
  echo cp ${amerine}/$i .
done
subset='d7mw79 d75h0t d7mh0v d7bp50 d7dk6z'
for i in ${subset}; do
  d=$(cd ${menus}; find . -maxdepth 4 -type d -name $i);
  [[ -d items/$d ]] || mkdir -p items/$d;
  rsync -a ${menus}/$d/ items/$d --exclude=ldp.ttl
done

#+END_SRC

#+RESULTS:
| cp | /home/quinn/amerine-menus/Makefile  | 0 |
| cp | /home/quinn/amerine-menus/index.ttl | 0 |
| cp | /home/quinn/amerine-menus/graph.ttl | 0 |
